Revit 2027 API
FamilyManager.SetDescription Method
Set the description for an existing family parameter. The description will be used as tooltip in the Revit UI including in the properties palette.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDescription(
	FamilyParameter familyParameter,
	string description
)
Public Sub SetDescription (
	familyParameter As FamilyParameter,
	description As String
)
public:
void SetDescription(
	FamilyParameter^ familyParameter,
	String^ description
)
member SetDescription :
        familyParameter : FamilyParameter *
        description : string -> unit
Parameters
familyParameter FamilyParameter
The family parameter.
description String
The description of the family parameter.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"familyParameter"-is null.
ArgumentException |  Thrown when the input argument-"familyParameter"-is an invalid parameter or a builtIn parameter.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace